app/controllers/api/v1/users_controller.rb

      def index
        render json: User.all, include: ['listings','communities','conversations','organizations']
---
SELECT "communities".* FROM "communities" WHERE "communities"."user_id" = $1  [["user_id", 18]]
SELECT "conversations".* FROM "conversations" WHERE "conversations"."user_id" = $1  [["user_id", 18]]
SELECT "listings".* FROM "listings" INNER JOIN "sellers" ON "listings"."seller_id" = "sellers"."id" WHERE "sellers"."user_id" = $1  [["user_id", 18]]
SELECT "organizations".* FROM "organizations" INNER JOIN "communities" ON "organizations"."id" = "communities"."organization_id" WHERE "communities"."user_id" = $1  [["user_id", 18]]