api/app/controllers/api/v1/sellers_controller.rb

			def index
				@sellers = Seller.joins(:listings)
---
SELECT "sellers".* FROM "sellers" INNER JOIN "listings" ON "listings"."seller_id" = "sellers"."id"